---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModuleIterator.IsDone
source: html/5bdae35f-f688-519e-6f13-64515ad8e384.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.